trunk/Rechnungsverwaltung/app/views/customers/show.html.erb

SELECT "addresses".* FROM "addresses" WHERE ("addresses".customer_id = 5)
---
<!-- <%# @address = Address.new %> -->
<% @addresses = Address.find_all_by_customer_id(@customer.id)%>