Rechnungsverwaltung/app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("street", "plz", "city", "customers_id", "created_at", "updated_at") VALUES ('sad', 'asd', 'asd', NULL, '2011-08-31 10:01:19.170345', '2011-08-31 10:01:19.170345') RETURNING "id"
---
  def create
    @address = Address.new(params[:address])

      if @address.save

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = 1 LIMIT 1
---
  def show
    @address = Address.find(params[:id])

SELECT "addresses".* FROM "addresses" WHERE ("addresses".customer_id = 12)
DELETE FROM "addresses" WHERE "addresses"."id" = 11
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy