Rechnungsverwaltung/app/controllers/customers_controller.rb

  def index #index.html.erb
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def create
    cust = params["cust"]
    add = params["add"]
    custatt = params["custatt"]

    @customer = Customer.find_by_id(cust[:id])
    #puts "################# #{@customer}"
    if @customer != nil
      @customer.update_attributes(cust)
    else
      @customer = Customer.new(cust)
    end

    @address = Address.find_by_id(add[:id])
    if @address != nil
      @address.update_attributes(add)
    else
      @address = Address.create(add)
    end

    @customerattribute = CustomerAttribute.find_by_id(custatt[:id])
    if @customerattribute != nil
      @customerattribute.update_attributes(custatt)
    else
      @customerattribute = CustomerAttribute.create(custatt)
---
UPDATE "addresses" SET "customer_id" = 13, "updated_at" = '2011-08-31 12:18:25.726755' WHERE "addresses"."id" = 14
INSERT INTO "addresses" ("street", "plz", "city", "customer_id", "created_at", "updated_at") VALUES ('rez', 'erz', 'ertz', NULL, '2011-08-31 11:40:06.972433', '2011-08-31 11:40:06.972433') RETURNING "id"
INSERT INTO "customers" ("firstname", "lastname", "addresses_id", "invoices_id", "created_at", "updated_at", "companyname") VALUES ('Martin', 'Kolb', NULL, NULL, '2011-08-31 08:56:02.905446', '2011-08-31 08:56:02.905446', 'delphit') RETURNING "id"

  def show #show.html.erb
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = 1 LIMIT 1

  def destroy
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = 12 LIMIT 1