Rechnungsverwaltung/app/controllers/invoices_controller.rb

  def index #index.html.erb
    @invoices = Invoice.all
---
SELECT "invoices".* FROM "invoices"

  def create #show.html.erb
    @invoice = Invoice.new({:invoicenr => params[:invoicenr], :customer_id => params[:customer_id], :date => params[:date]})
    if ( @invoice.invoicenr != Invoice.find_by_invoicenr(params[:invoicenr]))
        if @invoice.save
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."invoicenr" = '11-10001' LIMIT 1
INSERT INTO "invoices" ("invoicenr", "customer_id", "invoice_posses_id", "created_at", "updated_at") VALUES ('asd', 1, NULL, '2011-09-05 10:37:39.547799', '2011-09-05 10:37:39.547799') RETURNING "id"

  def show #show.html.erb
    @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = 1 LIMIT 1