trunk/Rechnungsverwaltung/app/controllers/customers_controller.rb

INSERT INTO "addresses" ("street", "plz", "city", "customer_id", "created_at", "updated_at") VALUES ('rez', 'erz', 'ertz', NULL, '2011-08-31 11:40:06.972433', '2011-08-31 11:40:06.972433') RETURNING "id"
INSERT INTO "customers" ("firstname", "lastname", "addresses_id", "invoices_id", "created_at", "updated_at", "companyname") VALUES ('Martin', 'Kolb', NULL, NULL, '2011-08-31 08:56:02.905446', '2011-08-31 08:56:02.905446', 'delphit') RETURNING "id"
---
  def create
    @customer = Customer.new(params[:customer])

    @address = Address.create(params[:address])
    @customer.addresses << @address

SELECT "customers".* FROM "customers" WHERE "customers"."id" = 12 LIMIT 1
---
  def destroy
    @customer = Customer.find(params[:id])