trunk/Rechnungsverwaltung/app/controllers/invoice_posses_controller.rb

  def index
    @invoiceposses = InvoicePoss.all
---
SELECT "invoice_posses".* FROM "invoice_posses"

  def create
    @invoiceposs = InvoicePoss.new(params[ :invoicepos])

    respond_to do |format|
      if @invoiceposs.save
---
INSERT INTO "invoice_posses" ("invoiceposnr", "description", "qty", "unitprice", "total", "invoice_id", "created_at", "updated_at") VALUES ('1', 'asd', 1, 1.0, 1.0, NULL, '2011-09-07 11:16:03.867936', '2011-09-07 11:16:03.867936') RETURNING "id"

  def show
    @invoiceposs = InvoicePoss.find(params[:id])
---
SELECT "invoice_posses".* FROM "invoice_posses" WHERE "invoice_posses"."id" = 1 LIMIT 1