Rechnungsverwaltung/app/views/invoices/show.html.erb

SELECT "invoice_posses".* FROM "invoice_posses" WHERE ("invoice_posses".invoice_id = 31)
---
<% @customer = @invoice.customer %>
<% @invoiceposses = InvoicePoss.find_all_by_invoice_id(@invoice.id) %>